---
kind: property
id: P:Autodesk.Revit.Attributes.JournalingAttribute.Mode
source: html/e7dfc93a-1934-7fc3-0e31-f923d814224b.htm
---
# Autodesk.Revit.Attributes.JournalingAttribute.Mode Property

Journaling mode.

## Syntax (C#)
```csharp
public JournalingMode Mode { get; }
```